def factorize(*number):

    # YOUR CODE HERE
    raise NotImplementedError()


a, b, c, d = factorize(128, 255, 99999, 10651060)

assert a == [1, 2, 4, 8, 16, 32, 64, 128]
assert b == [1, 3, 5, 15, 17, 51, 85, 255]
assert c == [1, 3, 9, 41, 123, 271, 369, 813, 2439, 11111, 33333, 99999]
assert d == [1, 2, 4, 5, 7, 10, 14, 20, 28, 35, 70, 140, 76079, 152158, 304316, 380395, 532553, 760790, 1065106,
             1521580, 2130212, 2662765, 5325530, 10651060]

# Напишите реализацию функции factorize которая принимает список чисел и возвращает список чисел, на которые числа из
# входного списка делятся без остатка. Реализуйте синхронную версию и измерьте время выполнения. Потом улучшите
# производительность вашей функции реализовав использование нескольких ядер процессора для параллельных вычислений и
# замерьте время выполнения опять. Для проверки правильности работы алгоритма самой функции можете воспользоваться
# тестом:
